In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import pymysql
pymysql.install_as_MySQLdb()

from urllib.parse import quote_plus as urlquote # must have for special char pwd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

import json

In [28]:
tmdb_data = pd.read_csv('DATA/tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
4,tt0116748,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,5.5,2.0,NaN

In [101]:
rating= pd.read_csv('DATA/title.ratings.tsv.gz', compression='gzip', sep='\t', low_memory=False)

In [102]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1250442 entries, 0 to 1250441
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1250442 non-null  object
 1   averageRating  1250442 non-null  float64
 2   numVotes       1250442 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.6+ MB

In [106]:
rating.to_csv('DATA/title.ratings.csv.gz',compression='gzip',index=False)
rating = pd.read_csv('DATA/title.ratings.csv.gz')

In [105]:
akas= pd.read_csv('DATA/title.akas.tsv.gz', compression='gzip', sep='\t', low_memory=False)

In [108]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32428306 entries, 0 to 32428305
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 1.9+ GB

In [109]:
akas.isnull().sum()

titleId              0
ordering             0
title                4
region             103
language             0
types                0
attributes           0
isOriginalTitle      0
dtype: int64

In [110]:
akas = akas.loc[akas['region'] == 'US']
akas.tail(10)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
32427534,tt9916348,1,Ancient World Exposed,US,\N,imdbDisplay,\N,0
32427548,tt9916362,18,Coven,US,\N,imdbDisplay,\N,0
32427638,tt9916428,3,The Secret of China,US,\N,imdbDisplay,\N,0
32427816,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,\N,imdbDisplay,\N,0
32427886,tt9916620,1,The Copeland Case,US,\N,imdbDisplay,\N,0
32427977,tt9916702,1,Loving London: The Playground,US,\N,imdbDisplay,\N,0
32428015,tt9916720,10,The Demonic Nun,US,\N,tv,\N,0
32428017,tt9916720,12,The Nun 2,US,\N,imdbDisplay,\N,0
32428034,tt9916756,1,Pretty Pretty Black Girl,US,\N,imdbDisplay,\N,0
32428050,tt9916764,1,38,US,\N,imdbDisplay,\N,0

In [111]:
akas = akas.replace(r'\N', 'Missing')

In [112]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,Missing,imdbDisplay,Missing,0
14,tt0000002,7,The Clown and His Dogs,US,Missing,Missing,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,Missing,imdbDisplay,Missing,0
36,tt0000005,1,Blacksmithing Scene,US,Missing,alternative,Missing,0
41,tt0000005,6,Blacksmith Scene #1,US,Missing,alternative,Missing,0

In [117]:
akas.to_csv('DATA/title.akas.csv.gz',compression='gzip',index=False)
akas = pd.read_csv('DATA/title.akas.csv.gz', low_memory=False)

In [120]:
title_basics = pd.read_csv('DATA/title_basics.csv.gz')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [30]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4418 entries, 0 to 4417
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4418 non-null   object
 1   adult                  4416 non-null   float64
 2   backdrop_path          1870 non-null   object
 3   belongs_to_collection  243 non-null    object
 4   budget                 4416 non-null   float64
 5   genres                 4416 non-null   object
 6   homepage               227 non-null    object
 7   id                     4416 non-null   float64
 8   original_language      4416 non-null   object
 9   original_title         4416 non-null   object
 10  overview               4052 non-null   object
 11  popularity             4416 non-null   float64
 12  poster_path            3695 non-null   object
 13  production_companies   4416 non-null   object
 14  production_countries   4416 non-null   object
 15  release_date           4373 non-null   object
 16  revenue                4416 non-null   float64
 17  runtime                4416 non-null   float64
 18  spoken_languages       4416 non-null   object
 19  status                 4416 non-null   object
 20  tagline                1221 non-null   object
 21  title                  4416 non-null   object
 22  video                  4416 non-null   float64
 23  vote_average           4416 non-null   float64
 24  vote_count             4416 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 897.5+ KB

In [31]:
tmdb_data = tmdb_data.drop(tmdb_data.columns[[1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24]], axis=1)  # df.columns is zero-based pd.Index
tmdb_data.head()

     imdb_id      budget  revenue certification
0          0         NaN      NaN           NaN
1  tt0113026  10000000.0      0.0           NaN
2  tt0113092         0.0      0.0           NaN
3  tt0116391         0.0      0.0           NaN
4  tt0116748         0.0      0.0           NaN

In [32]:
tmdb_data.isnull().sum()

imdb_id             0
budget              2
revenue             2
certification    3603
dtype: int64

In [34]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4418 entries, 0 to 4417
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        4418 non-null   object
 1   budget         4416 non-null   float64
 2   revenue        4416 non-null   float64
 3   certification  815 non-null    object
dtypes: float64(2), object(2)
memory usage: 138.2+ KB

In [33]:
tmdb_data['certification'].value_counts()

R          465
PG-13      181
NR          69
PG          65
G           26
NC-17        7
Unrated      1
-            1
Name: certification, dtype: int64

In [35]:
tmdb_data[['budget', 'revenue']] = tmdb_data[['budget','revenue']].fillna(0)

In [36]:
tmdb_data['certification'] = tmdb_data['certification'].str.replace("-", "Missing")
tmdb_data.certification = tmdb_data.certification.fillna('Missing')

In [37]:
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [38]:
title_basics.isnull().sum()

tconst                 0
titleType              0
primaryTitle           0
originalTitle          0
isAdult                0
startYear              0
endYear           140228
runtimeMinutes         0
genres                 0
genres_split           0
dtype: int64

In [39]:
title_basics['endYear'] = title_basics['endYear'].fillna(0)

In [40]:
title_basics.isnull().sum()

tconst            0
titleType         0
primaryTitle      0
originalTitle     0
isAdult           0
startYear         0
endYear           0
runtimeMinutes    0
genres            0
genres_split      0
dtype: int64

In [41]:
exploded_genres = title_basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,0.0,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,0.0,122,Drama,Drama

In [42]:
genres_split = title_basics['genres'].str.split(",")

In [43]:
genres = genres_split.explode().unique()
genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'War', 'Horror', 'Sci-Fi',
       'Music', 'Thriller', 'Mystery', 'Adventure', 'Musical', 'Action',
       'Crime', 'Animation', 'Family', 'History', 'Biography', 'Sport',
       'Western', 'Adult', 'Short', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [44]:
genres = sorted(exploded_genres['genres_split'].unique())
genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [45]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [47]:
genres_ints = range(len(genres))
genres_dic = dict(zip(genres, genres_ints))
genres_dic

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [48]:
title_genres['genre_id'] = title_genres['genres_split'].map(genres_dic)
title_genres = title_genres.drop(columns='genres_split')

In [49]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [50]:
genres_df= pd.DataFrame ({'genre_name': genres_dic.keys(),
                              'genre_id' : genres_dic.values()})
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [86]:
title_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,0.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,0.0,70
2,tt0069049,The Other Side of the Wind,2018,0.0,122
3,tt0079644,November 1828,2001,0.0,140
4,tt0088751,The Naked Monster,2005,0.0,100

In [66]:
title_basics.drop(['titleType','isAdult','originalTitle','genres','genres_split'], axis=1, inplace=True)

In [67]:
title_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,0.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,0.0,70
2,tt0069049,The Other Side of the Wind,2018,0.0,122
3,tt0079644,November 1828,2001,0.0,140
4,tt0088751,The Naked Monster,2005,0.0,100

In [69]:
max_str_len = title_genres['tconst'].fillna('').map(len).max()
genre_name_len = genres_df['genre_name'].fillna('').map(len).max()

In [93]:
from sqlalchemy.types import *
key_len = title_basics['tconst'].fillna('').map(len).max()
pri_title_len = title_basics['primaryTitle'].fillna('').map(len).max()
imdb_id_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

## Create a schema dictionary for title_basics using SQL alchemy datatype objects
title_basics_schema = {
     "tconst": String(key_len+1), 
     "primaryTitle": Text(pri_title_len+1),
     'startYear': Integer(),
     'endYear': Integer(),
     'runtimeMinutes': Integer()}

## Create a schema dictionary for genres using SQL alchemy datatype objects
genres_schema = {
     "genre_name": String(max_str_len+1),
     'genre_id': Integer()}

## Create a schema dictionary for tmdb_data using SQL alchemy datatype objects
tmdb_data_schema = {
     "imdb_id": String(imdb_id_len+1),
     'budget': Float(),
     'revenue': Float(),
     'certification': Text(cert_len+1)}

In [94]:
username = 'root'
password = 'Edward@1990'

In [95]:
from urllib.parse import quote_plus as urlquote

connection = f'mysql+pymysql://{username}:{urlquote(password)}@localhost/tmdb'

engine = create_engine(connection)

In [96]:
engine

Engine(mysql+pymysql://root:***@localhost/tmdb)

In [97]:
if database_exists(connection):
    print("It exists")
else:
    create_database(connection)
    print("Created database")

Created database

In [121]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=title_basics_schema,if_exists='replace',index=False)

# Save to sql with dtype and index=False
genres_df.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)

# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_data_schema,if_exists='replace',index=False)

In [119]:
# Upload title_ratings to movies db
rating.to_sql('title_ratings',engine,if_exists='replace',index=False)

# Upload title_genres to movies db
title_genres.to_sql('title_genres',engine,if_exists='replace', index=False)

In [122]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_tmdb
0         genres
1   title_basics
2   title_genres
3  title_ratings
4      tmdb_data

In [123]:
q1 = """SELECT *
FROM genres
LIMIT 5;"""
pd.read_sql(q1,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [124]:
q2 = """SELECT *
FROM title_basics
LIMIT 5;"""
pd.read_sql(q2,engine)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,None,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,None,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,None,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,None,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,None,100,"Comedy,Horror,Sci-Fi"

In [125]:
q3 = """SELECT *
FROM title_genres
LIMIT 5;"""
pd.read_sql(q3,engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [126]:
q4 = """SELECT *
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q4,engine)

     imdb_id      budget  revenue certification
0          0         0.0      0.0       Missing
1  tt0113026  10000000.0      0.0       Missing
2  tt0113092         0.0      0.0       Missing
3  tt0116391         0.0      0.0       Missing
4  tt0116748         0.0      0.0       Missing